# messages.py
def msg(key):
    data = {
        "start_guest": "👋 سلام! به ربات دانلودر حرفه‌ای خوش آمدی!\n\n"
                       "📥 قابلیت‌های حالت مهمان:\n"
                       "• دانلود اینستاگرام\n"
                       "• دانلود اسپاتیفای\n\n"
                       "⚠️ برای دانلود یوتیوب، تیک‌تاک و ساندکلاد باید حساب بسازی.\n\n"
                       "💡 فقط لینک رو بفرست — دانلود خودکار شروع میشه.",

        "start_member": "👋 خوش آمدی عزیز!\n"
                        "💼 شما وارد حساب کاربری خود شدید.\n"
                        "📥 برای دانلود کافیست لینک را ارسال کنید.",

        "help_guest": "📖 راهنمای حالت مهمان:\n\n"
                      "1– فقط از اینستاگرام و اسپاتیفای می‌تونی دانلود کنی.\n"
                      "2– برای فعال شدن یوتیوب و تیک‌تاک باید حساب بسازی.\n"
                      "3– لینک رو بفرست → بلافاصله دانلود شروع میشه.",

        "help_member": "📖 راهنمای پنل کاربری:\n\n"
                       "1– از همه پلتفرم‌ها می‌تونی دانلود کنی.\n"
                       "2– لینک را بفرست → ویدیو یا فایل ارسال می‌شود.\n"
                       "3– کیفیت خروجی به‌صورت خودکار تنظیم می‌شود.",

        "about": "ℹ درباره ما:\n\n"
                 "این ربات توسط محمد ساخته شده.\n"
                 "ارتباط: @Mohammad778889",

        "rules": "📜 قوانین:\n\n"
                 "• هرگونه سوءاستفاده ممنوع است.\n"
                 "• مسئولیت استفاده بر عهده کاربر است.\n"
                 "• از ارسال لینک‌های غیرقانونی خودداری کنید.",

        "ask_name": "اسم شما چیه؟",
        "ask_username": "یک نام کاربری وارد کن (فقط حروف و عدد)",
        "ask_password": "یک رمز عبور وارد کن (حداقل 6 کاراکتر با حرف و عدد)",

        "reg_done": "🎉 حساب با موفقیت ساخته شد!",
        "reg_fail": "❌ ساخت حساب ناموفق بود. دوباره تلاش کن.",

        "login_username": "یوزرنیم خود را وارد کنید:",
        "login_password": "رمز عبور خود را وارد کنید:",
        "login_success": "ورود موفقیت‌آمیز!",
        "login_fail": "❌ یوزرنیم یا رمز اشتباه است.",

        "choose_language": "🌐 زبان دلخواه خود را انتخاب کنید:",
        "lang_changed": "✅ زبان با موفقیت تغییر کرد.",

        "guest_block": "⚠️ این قابلیت فقط برای اعضا فعال است.\nبرای استفاده حساب بسازید.",

        "unknown": "❓ دستور ناشناخته است.",
        "downloading": "⬇️ درحال دانلود...",
        "download_done": "✅ دانلود انجام شد!"
    }
    return data[key]
